; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p4---int100n150-m25---int100c150---s95---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level11 level11)
(sum level0 level15 level15)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level11 level12)
(sum level1 level15 level16)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level11 level13)
(sum level2 level15 level17)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level11 level14)
(sum level3 level15 level18)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level11 level15)
(sum level4 level15 level19)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level11 level16)
(sum level5 level15 level20)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level11 level17)
(sum level6 level15 level21)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level11 level18)
(sum level7 level15 level22)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level11 level19)
(sum level8 level15 level23)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level11 level20)
(sum level9 level15 level24)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level11 level21)
(sum level10 level15 level25)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level11 level22)
(sum level11 level15 level26)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level11 level23)
(sum level12 level15 level27)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level11 level24)
(sum level13 level15 level28)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level11 level25)
(sum level14 level15 level29)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level11 level26)
(sum level15 level15 level30)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level11 level27)
(sum level16 level15 level31)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level11 level28)
(sum level17 level15 level32)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level11 level29)
(sum level18 level15 level33)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level11 level30)
(sum level19 level15 level34)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level11 level31)
(sum level20 level15 level35)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level11 level32)
(sum level21 level15 level36)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level11 level33)
(sum level22 level15 level37)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level11 level34)
(sum level23 level15 level38)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level11 level35)
(sum level24 level15 level39)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level11 level36)
(sum level25 level15 level40)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level11 level37)
(sum level26 level15 level41)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level11 level38)
(sum level27 level15 level42)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level11 level39)
(sum level28 level15 level43)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level11 level40)
(sum level29 level15 level44)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level11 level41)
(sum level30 level15 level45)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level11 level42)
(sum level31 level15 level46)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level11 level43)
(sum level32 level15 level47)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level11 level44)
(sum level33 level15 level48)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level11 level45)
(sum level34 level15 level49)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level11 level46)
(sum level35 level15 level50)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level11 level47)
(sum level36 level15 level51)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level11 level48)
(sum level37 level15 level52)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level11 level49)
(sum level38 level15 level53)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level11 level50)
(sum level39 level15 level54)
(sum level39 level17 level56)
(sum level39 level21 level60)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level11 level51)
(sum level40 level15 level55)
(sum level40 level17 level57)
(sum level40 level21 level61)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level11 level52)
(sum level41 level15 level56)
(sum level41 level17 level58)
(sum level41 level21 level62)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level11 level53)
(sum level42 level15 level57)
(sum level42 level17 level59)
(sum level42 level21 level63)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level11 level54)
(sum level43 level15 level58)
(sum level43 level17 level60)
(sum level43 level21 level64)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level11 level55)
(sum level44 level15 level59)
(sum level44 level17 level61)
(sum level44 level21 level65)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level11 level56)
(sum level45 level15 level60)
(sum level45 level17 level62)
(sum level45 level21 level66)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level11 level57)
(sum level46 level15 level61)
(sum level46 level17 level63)
(sum level46 level21 level67)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level11 level58)
(sum level47 level15 level62)
(sum level47 level17 level64)
(sum level47 level21 level68)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level11 level59)
(sum level48 level15 level63)
(sum level48 level17 level65)
(sum level48 level21 level69)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level11 level60)
(sum level49 level15 level64)
(sum level49 level17 level66)
(sum level49 level21 level70)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level11 level61)
(sum level50 level15 level65)
(sum level50 level17 level67)
(sum level50 level21 level71)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level11 level62)
(sum level51 level15 level66)
(sum level51 level17 level68)
(sum level51 level21 level72)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level11 level63)
(sum level52 level15 level67)
(sum level52 level17 level69)
(sum level52 level21 level73)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level11 level64)
(sum level53 level15 level68)
(sum level53 level17 level70)
(sum level53 level21 level74)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level11 level65)
(sum level54 level15 level69)
(sum level54 level17 level71)
(sum level54 level21 level75)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level11 level66)
(sum level55 level15 level70)
(sum level55 level17 level72)
(sum level55 level21 level76)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level11 level67)
(sum level56 level15 level71)
(sum level56 level17 level73)
(sum level56 level21 level77)
(sum level56 level22 level78)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level11 level68)
(sum level57 level15 level72)
(sum level57 level17 level74)
(sum level57 level21 level78)
(sum level57 level22 level79)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level11 level69)
(sum level58 level15 level73)
(sum level58 level17 level75)
(sum level58 level21 level79)
(sum level58 level22 level80)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level11 level70)
(sum level59 level15 level74)
(sum level59 level17 level76)
(sum level59 level21 level80)
(sum level59 level22 level81)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level11 level71)
(sum level60 level15 level75)
(sum level60 level17 level77)
(sum level60 level21 level81)
(sum level60 level22 level82)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level11 level72)
(sum level61 level15 level76)
(sum level61 level17 level78)
(sum level61 level21 level82)
(sum level61 level22 level83)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level11 level73)
(sum level62 level15 level77)
(sum level62 level17 level79)
(sum level62 level21 level83)
(sum level62 level22 level84)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level11 level74)
(sum level63 level15 level78)
(sum level63 level17 level80)
(sum level63 level21 level84)
(sum level63 level22 level85)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level11 level75)
(sum level64 level15 level79)
(sum level64 level17 level81)
(sum level64 level21 level85)
(sum level64 level22 level86)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level11 level76)
(sum level65 level15 level80)
(sum level65 level17 level82)
(sum level65 level21 level86)
(sum level65 level22 level87)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level11 level77)
(sum level66 level15 level81)
(sum level66 level17 level83)
(sum level66 level21 level87)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level11 level78)
(sum level67 level15 level82)
(sum level67 level17 level84)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level11 level79)
(sum level68 level15 level83)
(sum level68 level17 level85)
(sum level69 level1 level70)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level11 level80)
(sum level69 level15 level84)
(sum level69 level17 level86)
(sum level70 level1 level71)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level11 level81)
(sum level70 level15 level85)
(sum level70 level17 level87)
(sum level71 level1 level72)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level11 level82)
(sum level71 level15 level86)
(sum level72 level1 level73)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level11 level83)
(sum level72 level15 level87)
(sum level73 level1 level74)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level11 level84)
(sum level74 level1 level75)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level11 level85)
(sum level75 level1 level76)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level11 level86)
(sum level76 level1 level77)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level76 level11 level87)
(sum level77 level1 level78)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level78 level1 level79)
(sum level78 level2 level80)
(sum level78 level3 level81)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level79 level1 level80)
(sum level79 level2 level81)
(sum level79 level3 level82)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level80 level1 level81)
(sum level80 level2 level82)
(sum level80 level3 level83)
(sum level80 level6 level86)
(sum level80 level7 level87)
(sum level81 level1 level82)
(sum level81 level2 level83)
(sum level81 level3 level84)
(sum level81 level6 level87)
(sum level82 level1 level83)
(sum level82 level2 level84)
(sum level82 level3 level85)
(sum level83 level1 level84)
(sum level83 level2 level85)
(sum level83 level3 level86)
(sum level84 level1 level85)
(sum level84 level2 level86)
(sum level84 level3 level87)
(sum level85 level1 level86)
(sum level85 level2 level87)
(sum level86 level1 level87)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l3)
(fuelcost level1 l0 l3)
(connected l0 l4)
(fuelcost level6 l0 l4)
(connected l0 l6)
(fuelcost level3 l0 l6)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l1 l3)
(fuelcost level22 l1 l3)
(connected l1 l5)
(fuelcost level21 l1 l5)
(connected l2 l1)
(fuelcost level17 l2 l1)
(connected l2 l5)
(fuelcost level11 l2 l5)
(connected l2 l6)
(fuelcost level25 l2 l6)
(connected l2 l7)
(fuelcost level7 l2 l7)
(connected l3 l0)
(fuelcost level1 l3 l0)
(connected l3 l1)
(fuelcost level22 l3 l1)
(connected l3 l6)
(fuelcost level15 l3 l6)
(connected l4 l0)
(fuelcost level6 l4 l0)
(connected l5 l1)
(fuelcost level21 l5 l1)
(connected l5 l2)
(fuelcost level11 l5 l2)
(connected l5 l7)
(fuelcost level3 l5 l7)
(connected l6 l0)
(fuelcost level3 l6 l0)
(connected l6 l2)
(fuelcost level25 l6 l2)
(connected l6 l3)
(fuelcost level15 l6 l3)
(connected l7 l2)
(fuelcost level7 l7 l2)
(connected l7 l5)
(fuelcost level3 l7 l5)

(at t0 l0)
(fuel t0 level87)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l5)
(at p3 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l5)
(at p2 l4)
(at p3 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l1 level85 level2 level87)
   deleted: (at t0 l0) (fuel t0 level87)
   added: (at t0 l1) (fuel t0 level85)
   goals met: 0 of 4
2. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 4
3. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 4
4. (drive t0 l1 l2 level68 level17 level85)
   deleted: (at t0 l1) (fuel t0 level85)
   added: (at t0 l2) (fuel t0 level68)
   goals met: 0 of 4
5. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 1 of 4
6. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 4
7. (drive t0 l2 l5 level57 level11 level68)
   deleted: (at t0 l2) (fuel t0 level68)
   added: (at t0 l5) (fuel t0 level57)
   goals met: 1 of 4
8. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 1 of 4
9. (unload p1 t0 l5)
   deleted: (in p1 t0)
   added: (at p1 l5)
   goals met: 2 of 4
10. (unload p3 t0 l5)
   deleted: (in p3 t0)
   added: (at p3 l5)
   goals met: 3 of 4
11. (drive t0 l5 l1 level36 level21 level57)
   deleted: (at t0 l5) (fuel t0 level57)
   added: (at t0 l1) (fuel t0 level36)
   goals met: 3 of 4
12. (drive t0 l1 l0 level34 level2 level36)
   deleted: (at t0 l1) (fuel t0 level36)
   added: (at t0 l0) (fuel t0 level34)
   goals met: 3 of 4
13. (drive t0 l0 l4 level28 level6 level34)
   deleted: (at t0 l0) (fuel t0 level34)
   added: (at t0 l4) (fuel t0 level28)
   goals met: 3 of 4
14. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 4 of 4
